[
  {
    "company": "Raumdeuter GbR",
    "position": "Co-Founder, Technical Lead (Early Stage)",
    "location": "Leipzig, Germany",
    "startDate": "2024-11",
    "endDate": "2025-12",
    "current": false,
    "cvInclude": true,
    "description": "Building a modern communication and engagement platform for members and fans of clubs and associations to enable participation and engagement — a way to voice your opinion. I led the technical development: from conceptualization and architecture to implementation of the product as a customer-deployed MVP with the help of a 4-person development team and coordinated external IT partners.",
    "achievementsShort": [
      "Delivered a customer-deployed MVP 0 → 1 in under 12 months on a €30k budget, targeting capital-efficient scale.",
      "Led product ideation workshops to align vision and product-solution fit roadmap.",
      "Architected ML/NLP pipelines (RAG, sentiment, topic clustering) as core AI/ML solution capabilities.",
      "Owned infrastructure and DevOps delivery, cutting release friction and improving onboarding for interns, contractors, and external partners."
    ],
    "achievements": [
      "Given an ambiguous initial problem configuration, I led the product ideation workshops to align team vision and product-solution fit roadmap.",
      "Built engagement platform from 0 → 1 in less than 12 months on a €30k budget (likely resulting in approx. EUR 1.5M post-money valuation).",
      "Owned software architecture of the SaaS: Designed {{microservices}} utilizing {{docker}} {{containerization}} ({{distroless}}, {{multistage-build}}) using robust and easily expandable {{service-mesh}} patterns to ensure fast scalability and prevent expensive rebuilding 'prototype slug' later on.",
      "Stabilized the frontend delivery pipeline: configured and optimized {{nextjs}} builds in a multi-workspace monorepo, and ensured reproducible builds across environments to lower time spent and costs per dev on platform issues.",
      "Established {{devex}}/{{devops}}: {{cicd}}, {{linting}} and {{pre-commit-hooks}}, logging and testing across {{nextjs}} and Python services, cutting release friction and significantly improving onboarding speed for new hires.",
      "Owned system administration and networking: Microsoft tenant administration, {{ssl}}/{{dns}} management and {{nginx}} routing configuration for domains and services.",
      "Developed {{ml}} and (agentic) NLP pipelines in Python: {{semantic-chunking}} + {{rag}} vectorization using {{qdrant}}, {{sentiment-analysis}}, {{topic-clustering}} and content summarization as analysis services and core value contributor to our customers.",
      "Established {{gdpr}}-compliant data privacy and {{privacy-by-design}} practices to address jurisdictional circumstances and obtain a valuable quality label.",
      "Owned end-to-end technical delivery and coordinated interns, contractors, and external partners; partnered closely with the frontend lead."
    ],
    "technologies": [
      "Docker",
      "Docker Compose",
      "Python",
      "Bash",
      "SpaCy",
      "pytest",
      "FastAPI",
      "gRPC",
      "Protocol Buffers",
      "JavaScript",
      "TypeScript",
      "Next.js",
      "React",
      "Qdrant",
      "RAG",
      "MongoDB",
      "MariaDB",
      "SQL",
      "LLMs",
      "NLP/ML",
      "nginx",
      "Linux",
      "CI/CD",
      "GitHub",
      "Docker Hub",
      "git"
    ]
  },
  {
    "company": "Rahn Education (Private School)",
    "position": "Mathematics Teacher (Substitute)",
    "location": "Leipzig, Germany",
    "startDate": "2022-11",
    "endDate": "2023-06",
    "current": false,
    "cvInclude": true,
    "description": "Responsible for the supervision of talented pupils (groups of 4 to 8)",
    "achievements": [
      "Prepared customized university-level material to challenge and spark interest in mathematics.",
      "Initiated a pupil-led lecture series about Artificial Intelligence and its use cases.",
      "Taught basic principles of the mathematics behind 3D printing and coding."
    ],
    "technologies": ["MS Teams", "PowerPoint", "Algebra", "gcode"]
  },
  {
    "company": "Child and Adolescent Psychiatry, Philipps University Marburg",
    "position": "Student Assistant",
    "location": "Marburg, Germany",
    "startDate": "2019-05",
    "endDate": "2021-01",
    "current": false,
    "cvInclude": true,
    "description": "Responsible for the validation and reproduction of earlier results of research as well as for programming {{ml}} algorithms in R to solve classification problems in the field of {{asd}} diagnosis.",
    "achievements": [
      "Hyperparameter tuning for decision trees/random forests improved diagnostic performance by ~10–15 percentage points; results supported 3 peer‑reviewed publications (~70 citations).",
      "Worked in a highly interdisciplinary manner with psychologists and medical doctors to understand the clinical background and implications of the data + explain the statistical methods to non-data scientists.",
      "Commended for a reliable, way of conveying statistical content; invited to stay on as a scientific researcher."
    ],
    "technologies": [
      "R",
      "ggplot2",
      "tidyverse",
      "Markdown",
      "HTML",
      "Machine Learning",
      "Decision Trees",
      "Random Forests",
      "Statistics",
      "Interdisciplinary Collaboration"
    ]
  },
  {
    "company": "Westphalia DataLab GmbH",
    "position": "Intern, Data Analyst",
    "location": "Münster, Germany",
    "startDate": "2019-08",
    "endDate": "2019-10",
    "current": false,
    "cvInclude": true,
    "pageBreakBefore": true,
    "description": "As a Data Analyst intern at Westphalia DataLab GmbH, I worked on a medical-diagnostics project combining 3D imaging and clinical data; developed and improved an experiment-tracking R/Shiny frontend and performed clinical-data analysis with Python and R.",
    "achievements": [
      "Enhanced experiment‑tracking R/Shiny frontend accessing data in {{mongodb}}/{{postgresql}} to improve researcher workflow.",
      "Analyzed 3D imaging + clinical datasets in Python/R to surface diagnostic insights.",
      "Internship evaluation rated performance as outstanding."
    ],
    "technologies": [
      "Python",
      "PyTorch",
      "Convolutional Neural Networks",
      "R",
      "data.table",
      "tidyverse",
      "R Shiny",
      "MongoDB",
      "PostgreSQL",
      "SQL",
      "Git"
    ]
  },
  {
    "company": "Red Bull Germany GmbH",
    "position": "Intern, Sport and Athletes Marketing",
    "location": "Munich, Germany",
    "startDate": "2016-03",
    "endDate": "2016-08",
    "current": false,
    "cvInclude": false,
    "description": "In my role as a Sport and Athletes Marketing Manager, I updated and maintained the athletes portfolio as an asset of high value to the marketing mix of Red Bull. I participated in the business planning process for 2017 by generating ideas, their evaluation and processing for presentation.",
    "achievements": [
      "Team Activation of THW Kiel including personalized asset design + production, and a flight for the team in one of Mateschitz's private hangar airplanes.",
      "Event Supervision and organizational role in projects such as the hospitality area for Red Bull's VIPs at MotoGP 2016."
    ],
    "technologies": ["Excel", "PowerPoint", "MS Office", "Creativity"]
  },
  {
    "company": "Red Bull Germany GmbH",
    "position": "Student Brand Manager",
    "location": "Hamburg, Germany",
    "startDate": "2013-05",
    "endDate": "2016-12",
    "current": false,
    "cvInclude": false,
    "description": "The Student Brand Manager program by Red Bull is designed to find and educate the next generation of Red Bull marketing experts. As a Student Brand Manager, I was responsible for organizing guerrilla marketing events and creating brand awareness among the student community. The role as an SBM allowed me to develop strong marketing and leadership skills while gaining practical experience in brand management from one of the most recognized brands worldwide.",
    "achievements": [
      "Student Brand Manager of the Year 2016 in North Germany",
      "Organized own campus events and moderated campus events of other Student Brand Managers",
      "Participated and supported regional and national events such as Red Bull Seifenkistenrennen and Red Bull Coast2Coast"
    ],
    "technologies": ["Excel", "PowerPoint", "MS Office", "Adobe Photoshop"]
  },
  {
    "company": "Goodgame Studios",
    "position": "Working Student, Human Resources",
    "location": "Hamburg, Germany",
    "startDate": "2011-08",
    "endDate": "2012-09",
    "current": false,
    "cvInclude": false,
    "description": "Starting out as an intern and later becoming a working student, I supported the HR team in various administrative tasks, recruitment processes, and employee onboarding activities. This role provided me with valuable insights into HR operations within a fast-growing startup company.",
    "achievements": [
      "The HR recruiting process resulted in hiring 70 new employees (up from 30) within one year, contributing to the company's rapid growth.",
      "I was responsible for scouting and selecting candidates, scheduling interviews, and coordinating communication between applicants and hiring managers, improving the efficiency of the recruitment process."
    ],
    "technologies": ["Excel", "MS Office"]
  }
]
