[
  {
    "name": "AutoCoverletter",
    "tagline": "Agenten-unterstützte Anschreiben-Automatisierung",
    "description": "Automatisiert den End-to-End-Prozess für Anschreiben mit Agenten, lokalen MCP-Ressourcen und Context Engineering, sodass Prompts fokussiert bleiben und mit lokalen Bewerbungsdaten abgestimmt sind.",
    "technologies": [
      "Agent-Workflows",
      "Lokales MCP",
      "Context Engineering",
      "Python",
      "Codex",
      "Typst",
      "Notion Connections"
    ],
    "startDate": "2026",
    "endDate": "Present",
    "links": {
      "GitHub": "https://github.com/thejonnyt/AutoCoverletter"
    },
    "highlights": [
      "Rund 90% des Anschreiben-Prozesses automatisiert, inklusive Notion-Sync und Bewerbungs-Tracking.",
      "Starke Anschreiben ohne Schmeichelei, Lügen oder Übertreibungen.",
      "Sauberes Design und konsistente Gestaltung.",
      "Über 10% Einladungsquote zu Erstgesprächen trotz schwachem Arbeitsmarkt."
    ],
    "featured": true
  },
  {
    "name": "Raumdeuter",
    "tagline": "Fan relationship Management Software",
    "description": "Zuhören. Verstehen. Handeln. Die Raumdeuter-Software hilft Sportclubs, Fanmeinungen in datenbasierte Entscheidungen und nachhaltiges Wissen zu verwandeln.",
    "technologies": [
      "zu wenige Ressourcen",
      "Überstunden",
      "Kreativität",
      "Teamwork",
      "Verantwortung"
    ],
    "startDate": "2024",
    "endDate": "2025",
    "links": {
      "LinkedIn": "https://www.linkedin.com/company/dieraumdeuter/",
      "Website": "https://dieraumdeuter.de"
    },
    "highlights": [
      "Raumdeuter steht für das Gespür, Chancen zu erkennen und zu verwandeln, wie Thomas Müller auf dem Platz. Die Software gibt Sportclubs das Werkzeug an die Hand, die Stimmen ihrer Fans in Erfolge abseits des Platzes zu übersetzen.",
      "Quantitative Umfragen, Zusammenfassung ähnlicher Texte mittels embedded vectors und Clustering-Verfahren in qualitativen Umfragen, Sentiment-Analyse der Ergebnisse zur frühen Trenderkennung.",
      "Die Software integriert sich nahtlos in bestehende Systeme wie Websites, Club-Apps oder Mitgliederportale. Damit bleibt alles im vertrauten Umfeld des Vereins. Fans müssen keine neue Plattform erlernen, sondern können direkt dort teilnehmen, wo sie ohnehin schon aktiv sind.",
      "Pilotprojekt (Website-Integration + Nutzer) mit einem Fußballclub aus der Region (Chemie Leipzig)."
    ],
    "featured": true
  },
  {
    "name": "Neuronale Maschinenübersetzung mit Pivot-Strategien",
    "tagline": "Masterarbeit über ressourcenarme Sprachpaare",
    "description": "Die Masterarbeit zeigt, dass Pivot-Übersetzungsstrategien vergleichbare Übersetzungsqualität mit 99% weniger parallelen Trainingsdaten erreichen, wodurch NMT für ressourcenarme Sprachpaare praktikabel wird.",
    "technologies": [
      "Neural Machine Translation",
      "Pivot-Based Translation",
      "Transformer-Architektur",
      "OpenNMT-Library",
      "Large Language Models",
      "Artificial Neural Networks",
      "OpenNMT-py",
      "PyTorch",
      "SentencePiece",
      "pandas",
      "NumPy",
      "scikit-learn",
      "Bash",
      "Python"
    ],
    "startDate": "2024",
    "endDate": "2024",
    "links": {
      "Thesis": "/files/Thesis, Tauscher.pdf",
      "Podcast": "/files/Thesis Podcast.mp3"
    },
    "highlights": [
      "Erreichte 70-80% der direkten Übersetzungsqualität mit nur 1% paralleler Daten durch die Nutzung von Englisch als Brückensprache zwischen Französisch und Deutsch.",
      "Das leistungsstärkste Pivot-Modell zeigte substanzielle Verbesserungen gegenüber der Baseline: +15,4% BLEU, +5,8% chrF und -4,7% TER-Scores.",
      "Demonstrierte einen klaren Zusammenhang zwischen Pivot-Ressourcenverfügbarkeit und Übersetzungsqualität mittels Transformer-Architektur.",
      "Lieferte grundlegende Erkenntnisse für ressourcenarme NMT und die Entwicklung großer Sprachmodelle."
    ],
    "featured": true
  },
  {
    "name": "Cook Up Kitchen",
    "tagline": "Pop-up Restaurant",
    "description": "Ein paar Freunde und ich starteten ein wiederkehrendes Pop-up-Restaurant in Hamburg, um zu prüfen, ob Food-Blogging eine tragfähige Marketingstrategie für Restaurants sein kann, was zu einer bis heute anhaltenden Geschäftschance für einen von uns führte.",
    "technologies": ["Heiße Pfanne", "Öl", "Kreativität", "Teamarbeit"],
    "startDate": "2013",
    "endDate": "2016",
    "links": {
      "Video": "https://vimeo.com/131561210",
      "resulted in": "https://thefoodguide.de/"
    },
    "highlights": [
      "2. Event: Video von professionellem Videografen produziert und auf Vimeo verfügbar.",
      "3. Event: Catering für 100 Personen in einer Nacht auf 3-Gänge-Menü-Basis in einer Küche, die dafür sehr eindeutig nicht ausgelegt war."
    ],
    "featured": true
  }
]
