[
  {
    "name": "Raumdeuter",
    "tagline": "Fanrelationship Management Software",
    "description": "Zuhören. Verstehen. Handeln. Raumdeuter hilft Sportclubs, Fanmeinungen in datenbasierte Entscheidungen und nachhaltiges Wissen zu verwandeln",
    "technologies": [
      "viel zu wenig Ressourcen",
      "Überstunden",
      "Kreativität",
      "Teamarbeit",
      "Verantwortung"
    ],
    "startDate": "2024",
    "endDate": "2025",
    "links": {
      "Website": "https://dieraumdeuter.de"
    },
    "highlights": [
      "Raumdeuter steht für das Gespür, Chancen zu erkennen und zu verwandeln, wie Thomas Müller auf dem Platz. Die Software gibt Sportclubs das Werkzeug an die Hand, um die Stimmen ihrer Fans in Erfolge abseits des Platzes zu übersetzen.",
      "Quantitaive Umfragen, Zusammenfassung ähnlicher Texte über embedded Vectors und Clustering-Verfahren in qualitativen Umfragen, Sentiment Analyse der Ergebnisse zur frühen Trenderkennung",
      "Die Software lässt sich nahtlos in bestehende Systeme wie Websites, Club-Apps oder Mitgliederportale integrieren. Damit bleibt alles im vertrauten Umfeld des Vereins. Die Fans müssen keine neue Plattform erlernen, sondern können direkt dort teilnehmen, wo sie ohnehin schon aktiv sind.",
      "Pilotprojekt (Website Integration+Nutzende) mit Fußballclub aus der Region (Chemie Leipzig)"
    ],
    "featured": true
  },
  {
    "name": "Neuronale Maschinenübersetzung mit Pivot-Strategien",
    "tagline": "Masterarbeit über ressourcenarme Sprachpaare",
    "description": "Die Masterarbeit zeigt, dass Pivot-Übersetzungsstrategien ähnliche Übersetzungsqualitäten erreichen, was jedoch mit 99% weniger parallelen Trainingsdaten erreicht werden kann, wodurch NMT für ressourcenarme Sprachpaare praktikabel wird.",
    "technologies": [
      "Neural Machine Translation",
      "Pivot-Based Translation",
      "Transformer-Architektur",
      "OpenNMT-Library",
      "Large Language Models",
      "Artificial Neural Networks",
      "Bash",
      "Python"
    ],
    "startDate": "2024",
    "endDate": "2024",
    "links": {
      "Thesis": "/files/Thesis, Tauscher.pdf",
      "Podcast": "/files/Thesis Podcast.mp3"
    },
    "highlights": [
      "Erreichte 70-80% der direkten Übersetzungsqualität mit nur 1% paralleler Daten durch die Nutzung von Englisch als Brückensprache zwischen Französisch und Deutsch",
      "Das leistungsstärkste Pivot-Modell zeigte substanzielle Verbesserungen gegenüber der Baseline: +15,4% BLEU, +5,8% chrF und -4,7% TER-Scores",
      "Demonstrierte klaren Zusammenhang zwischen Pivot-Ressourcenverfügbarkeit und Übersetzungsqualität mittels Transformer-Architektur",
      "Lieferte grundlegende Erkenntnisse für ressourcenarme NMT und die Entwicklung großer Sprachmodelle"
    ],
    "featured": true
  },
  {
    "name": "Cook Up Kitchen",
    "tagline": "PopUp Restaurant",
    "description": "Ein paar Freunde und ich starteten ein wiederkehrendes PopUp-Restaurant in Hamburg, um herauszufinden, ob Food-Blogging eine echte Marketing-Strategie für Restaurants sein könnte, was zu einer seitdem anhaltenden Business-Opportunity für einen von uns führte.",
    "technologies": ["Heiße Pfanne", "Öl", "Kreativität", "Teamarbeit"],
    "startDate": "2013",
    "endDate": "2016",
    "links": {
      "Video": "https://vimeo.com/131561210",
      "Website": "https://thefoodguide.de/"
    },
    "highlights": [
      "2. Event: Video produziert von professionellem Videografen verfügbar auf Vimeo",
      "3. Event: Catering für 100 Personen in einer Nacht auf 3-Gänge-Menü-Basis in einer Küche, die sehr eindeutig nicht dafür ausgelegt war"
    ],
    "featured": true
  }
]
