[
  {
    "title": "Phänotypische Unterschiede zwischen weiblichen und männlichen Personen mit Verdacht auf {{asd}}",
    "authors": [
      "Sanna Stroth",
      "Johannes Tauscher",
      "Nicole Beyer",
      "Charlotte Küpper",
      "Luise Poustka",
      "Stefan Roepke",
      "Veit Roessner",
      "Dominik Heider",
      "Inge Kamp-Becker"
    ],
    "venue": "Molecular Autism, 13 (1)",
    "year": 2022,
    "type": "article",
    "abstract": "Hintergrund Obwohl {{asd}} eine häufige Entwicklungsstörung ist, ist unser Wissen über einen verhaltensbezogenen und neurobiologischen weiblichen Phänotyp noch spärlich. Da die Konzeptualisierung und das Verständnis von {{asd}} hauptsächlich auf der Untersuchung männlicher Personen basieren, werden Frauen mit {{asd}} möglicherweise nicht angemessen durch routinemäßige klinische Diagnostik identifiziert. Der vorliegende {{ml}}-Ansatz zielte darauf ab, diagnostische Informationen aus dem {{ados}} zu identifizieren, die am besten zwischen {{asd}} und Nicht-{{asd}} bei Frauen und Männern unterscheiden. Methoden {{random-forests}} wurden verwendet, um Muster von Symptomen in diagnostischen Daten aus dem {{ados}} (Module 3 und 4) bei 1057 Teilnehmern mit {{asd}} (18,1% weiblich) und 1230 Teilnehmern mit Nicht-{{asd}} (17,9% weiblich) zu entdecken. Prädiktive Leistungen reduzierter Feature-Modelle wurden bei Frauen und Männern ohne intellektuelle Beeinträchtigungen untersucht und verglichen. Ergebnisse Reduzierte Feature-Modelle beruhten auf erheblich weniger Features aus dem {{ados}} bei Frauen im Vergleich zu Männern, während sie dennoch ähnliche Klassifikationsleistungen (z.B. Sensitivität, Spezifität) erzielten. Einschränkungen Wie in früheren Studien ist die aktuelle Stichprobe von Frauen mit {{asd}} kleiner als die männliche Stichprobe, und daher könnten Frauen immer noch unterrepräsentiert sein, was die statistische Macht zur Erkennung kleiner bis moderater Effekte einschränkt. Schlussfolgerung Unsere Ergebnisse deuten nicht auf die Notwendigkeit neuer oder veränderter diagnostischer Algorithmen für Frauen mit {{asd}} hin. Obwohl wir einige phänotypische Unterschiede zwischen Frauen und Männern identifizierten, scheinen die bestehenden diagnostischen Werkzeuge die Kern-autistischen Merkmale in beiden Gruppen ausreichend zu erfassen.",
    "links": {
      "doi": "https://doi.org/10.1186/s13229-022-00491-9"
    },
    "citations": 16,
    "featured": true
  },
  {
    "title": "Ist die Kombination von ADOS und ADI-R notwendig, um ASD zu klassifizieren? Überdenken des 'Goldstandards' bei der Diagnose von ASD",
    "authors": [
      "Sanna Stroth",
      "Johannes Tauscher",
      "Nicole Beyer",
      "Charlotte Küpper",
      "Luise Poustka",
      "Stefan Roepke",
      "Veit Roessner",
      "Dominik Heider",
      "Inge Kamp-Becker"
    ],
    "venue": "Frontiers of Psychiatry, 12",
    "year": 2021,
    "type": "article",
    "abstract": "Die Diagnose von {{asd}} erfordert umfangreiche klinische Expertise und Schulung sowie einen Fokus auf Differentialdiagnosen. Der diagnostische Prozess ist besonders komplex angesichts der Symptomüberlappung mit anderen psychischen Störungen und hohen Raten von gleichzeitig auftretenden körperlichen und psychischen Gesundheitsproblemen. Das Ziel dieser Studie war es, eine datengesteuerte Auswahl der relevantesten diagnostischen Informationen durchzuführen, die aus einer Verhaltensbeobachtung und einem anamnestischen Interview in zwei klinischen Stichproben von Kindern/jüngeren Jugendlichen und Jugendlichen/Erwachsenen mit Verdacht auf {{asd}} gesammelt wurden. Über {{random-forests}} entdeckte die vorliegende Studie Muster von Symptomen in den diagnostischen Daten von 2310 Teilnehmern (46% {{asd}}, 54% Nicht-{{asd}}, Altersbereich 4-72 Jahre) unter Verwendung von Daten aus dem kombinierten {{ados}} und {{adi-r}} und {{ados}}-Daten allein.",
    "links": {
      "doi": "https://doi.org/10.3389/fpsyt.2021.727308"
    },
    "citations": 45,
    "featured": true
  },
  {
    "title": "Identifikation der aussagekräftigsten und diskriminierendsten Merkmale aus diagnostischen Instrumenten für Kinder mit Autismus",
    "authors": [
      "Sanna Stroth",
      "Johannes Tauscher",
      "Nicole Wolff",
      "Charlotte Küpper",
      "Luise Poustka",
      "Stefan Roepke",
      "Veit Roessner",
      "Dominik Heider",
      "Inge Kamp-Becker"
    ],
    "venue": "JCPP Advances, Volume 1, Issue 2",
    "year": 2021,
    "type": "article",
    "abstract": "Die Diagnose von {{asd}} ist komplex und zeitaufwendig. Die vorliegende Arbeit untersucht systematisch die Bedeutung von Items aus dem {{adi-r}} und {{ados}} bei der Unterscheidung von Kindern mit und ohne {{asd}}. Kenntnisse über die diskriminierendsten Merkmale und ihre zugrunde liegenden Konzepte können sich als wertvoll für zukünftige Trainingstools erweisen, die Kliniker dabei unterstützen, einen Verdacht auf {{asd}} bei nonverbalen und minimal verbalen Kindern zu erhärten oder abzuschwächen.",
    "links": {
      "doi": "https://doi.org/10.1002/jcv2.12023"
    },
    "citations": 9,
    "featured": true
  }
]
